import React from 'react';

const Blogs = () => {
    return (
        <div className="grid md:grid-cols-2 sm:grid-cols-1 gap-4">
            <div className="shadow-lg">
           <h1 className="text-3xl text-amber-300">what is semantics tag</h1> 
           <p>
           এইচটিএমএল মূলত এটি একটি মার্কআপ ল্যাংগুয়েজ, 
এই মার্কাপ  ল্যাংগুয়েজ এর মাধ্যোমে ওয়েব সাইটে সব কিছু  দেখানো হয় ,
এই এইচটিমল ফাইভ আসার আগে সব কিছু কে একটা ডিভ কল্পনা করে কাজ করা হতো , তার আগে টেবিল দিয়ে কাজ করা হতো,ডিভ এর একটা প্রলেম ছিলো তার কোনটা ন্যভবার কোনটা হেডার ,কোনটা ফুটার কিছুই বোঝা যাচ্ছিলোনা ।তাই এই  প্রবলেম কে সলভ করার জন্য এইচটিমল  ফাইভ নিয়ে আসলো সিমান্টিক ট্যাগ ,
হয়তো আমরা  ডেভেলোপার হিসেবে বুঝতে পারতাম কোনটা হেডার কোনটা ফুটার কিন্তু এটা সার্চ ইঞ্জিন এর জন্য একটা প্রবলেম হয়ে যেতো ,
তাই প্রলেম সলভ করার জন্য এইচটিমল  ফাইভ নিয়ে আসছে সিমান্টিক ট্যাগ যার দ্বারা এই প্রব্লেম গুলো সলভ করা হয়,
আর এই কারনে এইটা সার্চ ইঞ্জিন ভালো ভাবে বুঝতে পারে ।
নিম্নে কিছু  সিমান্টিক ট্যাগ দেখানো হলোঃ 
<br />
article
aside
details
footer
header
main
mark
nav
section

      </p>
      </div>
      <div className="shadow-lg">
          <h1 className="text-3xl text-amber-300">what is context api</h1>
          <p>আপনি যদি প্রপস (প্যারেন্ট থেকে চাইল্ড) ব্যবহার করে অনেকগুলি উপাদানে ডেটা ভাগ করেন, আপনি প্রপস পদ্ধতি  ব্যবহার করেন, প্রথমে প্যারেন্ট এর কাছ থেকে একটি চাইল্ড কাছে ডেটা ভাগ করুন তারপর অন্য, কন্টেক্সট API আমাদের জন্য এটিকে সহজ করে দিয়েছে, আপনি দুটি উপাদানের মধ্যে যেকোনো ডেটা ভাগ করতে পারেন প্রতিটি স্তরের প্রপস ব্যবহার না করেই। আপনি কন্টেক্সট API ব্যবহার করে সরাসরি প্যারেন্ট উপাদান থেকে যেকোনো চাইল্ড উপাদানে ডেটা ভাগ করতে পারেন।</p>
      </div>
        </div>
    );
};

export default Blogs;